In [1]:
import pandas as pd

In [2]:
df = pd.read_html('http://sos.ga.gov/elections/election_results/2010_0720/0030402.htm')

In [3]:
df = df[1]

In [4]:
df.shape

(7, 34)

In [5]:
df.head(5)

,0,1,2,3,4,5,6,7,8,9,...,24,25,26,27,28,29,30,31,32,33
0,"U.S. Representative, District 4 Democratic 100...",NaN,NaN,"Johnson 28,095","Jones 13,407","Stokes 9,411","Totals 50,913",NaN,NaN,55.2%,...,797.0,443.0,344.0,1584.0,ROCKDALE,100%,2224.0,1131.0,776.0,4131.0
1,NaN,NaN,"Johnson 28,095","Jones 13,407","Stokes 9,411","Totals 50,913",NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,55.2%,26.3%,18.5%,100.0%,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,County,PPR,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,DEKALB,100%,25074,11833,8291,45198,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [6]:
df = df[4:]

In [7]:
df.head(5)

,0,1,2,3,4,5,6,7,8,9,...,24,25,26,27,28,29,30,31,32,33
4,DEKALB,100%,25074,11833,8291,45198,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,GWINNETT,100%,797,443,344,1584,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,ROCKDALE,100%,2224,1131,776,4131,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [8]:
df = df[df.columns[[0,2,3,4]]]

In [9]:
df.head(5)

          0      2      3     4
4    DEKALB  25074  11833  8291
5  GWINNETT    797    443   344
6  ROCKDALE   2224   1131   776

In [10]:
df.columns = ['county', 'Hank Johnson Jr', 'Vernon Jones', 'Connie Stokes']

In [11]:
df.tail(5)

     county Hank Johnson Jr Vernon Jones Connie Stokes
4    DEKALB           25074        11833          8291
5  GWINNETT             797          443           344
6  ROCKDALE            2224         1131           776

In [12]:
df = df.melt(id_vars=['county'])

In [13]:
df.columns = ['county', 'candidate', 'votes']

In [14]:
df.head()

     county        candidate  votes
0    DEKALB  Hank Johnson Jr  25074
1  GWINNETT  Hank Johnson Jr    797
2  ROCKDALE  Hank Johnson Jr   2224
3    DEKALB     Vernon Jones  11833
4  GWINNETT     Vernon Jones    443

In [15]:
df['votes'] = df['votes'].astype(int)

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 3 columns):
county       9 non-null object
candidate    9 non-null object
votes        9 non-null int64
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

In [17]:
df['office'] = 'U.S. Representative'

In [18]:
df['district'] = '4'

In [19]:
df['party'] = 'Democrat'

In [20]:
df.groupby(['candidate', 'party'])['votes'].sum()

candidate        party
Connie Stokes    Democrat     9411
Hank Johnson Jr  Democrat    28095
Vernon Jones     Democrat    13407
Name: votes, dtype: int64

In [21]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].head()

     county               office district     party        candidate  votes
0    DEKALB  U.S. Representative        4  Democrat  Hank Johnson Jr  25074
1  GWINNETT  U.S. Representative        4  Democrat  Hank Johnson Jr    797
2  ROCKDALE  U.S. Representative        4  Democrat  Hank Johnson Jr   2224
3    DEKALB  U.S. Representative        4  Democrat     Vernon Jones  11833
4  GWINNETT  U.S. Representative        4  Democrat     Vernon Jones    443

In [22]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].to_clipboard(index=False, sep=',')